{
  "_id": "6228cb385f506b78affc0ac1",
  "title": "Comment rédiger une page wiki ?",
  "slug": "comment-rediger-une-page-wiki",
  "tags": [],
  "approvalDate": "2000-01-01",
  "views": 0,
  "content": "==Comment créer une page wiki ? (Viking uniquement)==\nLorsque vous êtes sur le wiki, cliquez sur la plume en bas à droite. Vous pourrez alors proposer une nouvelle page wiki. Remplissez le formulaire avec votre page wiki, validez, attendez. Deux possibilités :\n- soit votre page sera validée et visible de tous ;\n- soit elle sera refusée.\nVous verrez le résultat sur votre liste de propositions, accessible par la même plume.\nVous pouvez aussi modifier votre proposition, ce qui vous permettra de l'améliorer après reçu des critiques.\n\n==Comment modifier une page wiki ? (Viking uniquement)==\nLorsque vous êtes sur une page wiki, cliquez sur la plume en haut à droite. Vous pourrez alors proposer une nouvelle version pour cette page wiki, de la même manière que pour en créer une.\n\nLa suite indique comment styliser votre texte de page wiki.\n\n==Titre==\nPour transformer une portion de texte en titre, entourez-la de deux signes \"égal\" : `==Titre==`\n\n==Italique==\nPour mettre une portion de texte en italique, entourez-la d'une étoile : `*Texte en italique*` {{HiArrowRight}} *Texte en italique*\n\n==Gras==\nPour mettre une portion de texte en gras, entourez-la de deux étoiles : `**Texte en gras**` {{HiArrowRight}} **Texte en gras**\n\n==Spoiler==\nPour cacher une portion de texte (jusqu'à ce que le lecteur clique dessus), entourez-la de deux barres verticales : `||Alerte Spoiler||` {{HiArrowRight}} ||Alerte Spoiler||\n\n==Barré==\nPour barrer une portion de texte, entourez-la de deux tildes : `~~Texte barré~~` {{HiArrowRight}} ~~Texte barré~~\n\n==Lien externe==\nPour transformer une url en lien, entourez-la d'un crochet : `[https://skali.vercel.app/valhabba]` {{HiArrowRight}} [https://skali.vercel.app/valhabba]\n\n==Lien interne au wiki==\nPour insérer un lien vers une autre page wiki (ce qui est le propre d'un wiki, et devrait être fait dès que possible !), entourez le nom de l'autre page wiki de deux crochets : `[[Commerce]]` {{HiArrowRight}} [[Commerce]] .\nSi vous souhaitez ne pas écrire exactement le nom de la page, vous pouvez écrire votre texte après une barre verticale :  `[[Commerce|Oglaf]]` {{HiArrowRight}} [[Commerce|Oglaf]] .\n\n==Lien Discord==\nPour transformer un lien en un bouton qui ouvre l'application Discord, entourez-le de trois crochets : `[[[https://discord.com/channels/843826987466227722/843848619181736017/863406175064555520]]]` {{HiArrowRight}} [[[https://discord.com/channels/843826987466227722/843848619181736017/863406175064555520]]]\nSi vous souhaitez changer le texte du bouton, ajoutez-le à la suite entre parenthèses : `[[[https://discord.com/channels/843826987466227722/843848619181736017/863406175064555520]]](Lien discord à voir absolument)` {{HiArrowRight}} [[[https://discord.com/channels/843826987466227722/843848619181736017/863406175064555520]]](Lien discord à voir absolument)\n\n==Icône==\nSkali utilise des bibliothèques d'icônes, que vous pouvez aussi utiliser dans vos pages wiki.\nPour choisir une icône, allez sur [https://react-icons.github.io/react-icons/search], et utilisez la barre de recherche ou consultez celles disponibles.\nUne fois que vous avez choisi votre icône, cliquez dessus pour copier son nom. Puis collez-le dans votre page wiki, et entourez-le de deux accolades :\n`{{GiAbdominalArmor}}` {{HiArrowRight}} {{GiAbdominalArmor}}\n\n==Image==\nPour afficher une image à partir d'une url, entourez-la de deux chevrons : `<</images/valheim-background-q60.jpg>>` : <</images/valheim-background-q60.jpg>>\nL'image sera alors placée dans un cadre de taille fixe et gardera son ratio de départ (elle ne sera jamais déformée).\nElle pourra toujours être cliquée pour être zoomée.\n\nPar défaut : \n- la taille du cadre est de 200x200 pixels\n- l'image est centrée sur une ligne à part entière\n- elle réduit sa taille jusqu'à rentrer entièrement dans le cadre\n- et, si elle ne remplit pas le cadre, elle se place au centre.\nVous pouvez changer ces 4 derniers éléments.\n\nPour changer la taille du cadre qui contiendra l'image, indiquez-la après avoir fermé les chevrons, sous le format largeur x hauteur : `<</images/valheim-background-q60.jpg>>100x50` : <</images/valheim-background-q60.jpg>>200x50\nComme l'image pourra toujours être zoomée en cliquant dessus, il est conseillé de choisir une taille minimale pour comprendre ce dont il s'agit du premier coup d'œil. Pour voir les détails, le lecteur pourra cliquer.\n\nPour que l'image soit alignée avec le texte, ajoutez la lettre `t` après les chevrons (et après les dimensions, s'il y en a) :\n`<</images/valheim-background-q60.jpg>>t` {{HiArrowRight}} <</images/valheim-background-q60.jpg>>t\n\nPour que l'image remplisse tout le cadre, quitte à n'en afficher qu'une partie, ajoutez de la même manière la lettre `r` (remplissage) : `<</images/valheim-background-q60.jpg>>50x200r` : <</images/valheim-background-q60.jpg>>50x200r\n\nVous pouvez également ajouter la lettre `h` (haut), `b` (bas), `g` (gauche) ou `d` (droite) pour positionner l'image.\nDans le mode par défaut (non remplissage), cela positionnera l'image dans le cadre.\nEn mode remplissage, cela positionnera le cadre dans l'image, et décidera donc si vous voulez afficher plutôt la portion en haut, en bas, à droite ou à gauche de l'image.\nReprenons l'exemple précédent mais affichons le côté gauche : `<</images/valheim-background-q60.jpg>>50x200rg` : <</images/valheim-background-q60.jpg>>50x200rg\n\nEnfin, vous pouvez ajouter une légende sous votre image, en l'ajoutant à la fin entre parenthèses :\n`<</images/valheim-background-q60.jpg>>200x100t(La légende de mon image)` {{HiArrowRight}} <</images/valheim-background-q60.jpg>>200x100t(La légende de mon image)\n\nIl est important de respecter l'ordre : les dimensions, puis les lettres, puis la légende. Mais aucune option n'est obligatoire.\n\nEn résumé : `<<url de l'image>>[largeurxhauteur][propriétés : t, r, h ou b ou g ou d][(légende)]`\n\n==Grille==\nPour positionner votre texte sur plusieurs colonnes, vous pouvez utiliser une `Grille` et ses `Colonne`s.\n\n```<Grille 30% 30% 40%>\n<Colonne>\nJe suis dans la première colonne !\n<Colonne>\nJe suis dans la deuxième colonne ! Et si je dépasse, je retourne à la ligne !\n<Colonne><<https://skali.vercel.app/images/valheim-background-q60.jpg>>200x100(Je suis une image dans la troisième colonne !)\n</Grille>```\n\n<Grille 30% 30% 40%>\n<Colonne>\n\nJe suis dans la première colonne !\n<Colonne>\n\nJe suis dans la deuxième colonne ! Et si je dépasse, je retourne à la ligne !\n<Colonne><</images/valheim-background-q60.jpg>>200x100(Je suis une image dans la troisième colonne !)\n</Grille>\nLa grille doit être entourée des balises <Grille> et </Grille>.\nLa première balise <Grille> doit contenir les dimensions de toutes vos colonnes, séparées par un espace. Les dimensions peuvent être en pourcentage %, en pixels, ou `auto` si elle doit prendre l'espace restant : `<Grille auto 200px>`.\nUne balise `<Colonne>` indique le début d'une colonne.\n\n==Code==\nPour ne pas interpréter les symboles ci-dessus, entourez votre texte d'une apostrophe inversée (`) pour un texte court, ou de 3 apostrophes inversées pour du texte sur plusieurs lignes."
}
